/* Copyright (c) 2012, Peter A. Bigot <bigotp@acm.org>
 * 
 * All rights reserved.
 * 
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 * 
 * * Redistributions of source code must retain the above copyright notice,
 *   this list of conditions and the following disclaimer.
 * 
 * * Redistributions in binary form must reproduce the above copyright notice,
 *   this list of conditions and the following disclaimer in the documentation
 *   and/or other materials provided with the distribution.
 * 
 * * Neither the name of the software nor the names of its contributors may be
 *   used to endorse or promote products derived from this software without
 *   specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)

 * define the interrupt handler for the entire port.  The abstraction
 * layer is supported only for the 8-bit port interface.
 *
 * @author Peter A. Bigot <bigotp@acm.org>
 * @date 2012
 * @homepage http://github.com/pabigot/freertos-mspgcc
 * @copyright <a href="http://www.opensource.org/licenses/BSD-3-Clause">BSD-3-Clause</a>
 */

/* !BSP430! periph=port */

#ifndef BSP430_PERIPH_PORT_H
#define BSP430_PERIPH_PORT_H

#include <bsp430/periph.h>
#if ! (defined(__MSP430_HAS_PORT1__) || defined(__MSP430_HAS_PORT1_R__))
#warning Peripheral not supported by configured MCU
#endif /* __MSP430_HAS_PORT1__ */

/* Analysis of port capabilities:
 *
 * 1xx: P1/P2 are uniform contiguous with interrupt capability.  P3-P6
 * are uniform contiguous without interrupt capability.  There is no
 * REN capability.
 *
 * 2xx: P1/P2 are uniform contiguous inclusive of REN but exclusive of
 * SEL2, which is contiguous at a distinct base address, and have
 * interrupt capability.  P3-P6 are uniform 8-bit and P7-P8 are
 * uniform 16-bit contiguous, exclusive of REN and SEL2.  PA=(P7,P8)
 * in the headers, but is not named as such in the user's guide.
 * 
 * 3xx: P1/P2 are uniform contiguous with interrupt capability.  P3-P4
 * are uniform contiguous without interrupt capability.  There is no
 * REN capability.
 * 
 * 4xx: P1/P2 are uniform contiguous including REN capability, and
 * have interrupt capability.  P3-P6 are uniform 8-bit and P7-P10 are
 * uniform 16-bit contiguous; these are exclusive of REN, which is
 * contiguous at a distinct base address.  PA=(P7,P8), PB=(P9,P10).
 *
 * 5xx: All ports uniform 16-bit contiguous.  PA=(P1,P2), PB=(P3,P4),
 * and so forth.  All registers have space reserved for interrupt
 * support.
 *
 * In the above, "8-bit" means that the register fields are
 * immediately adjacent with byte addresses.  "16-bit" means that
 * register pairs are interleaved within function; e.g. P1IN would be
 * at 0x00 while P2IN is at 0x01 and P1OUT at 0x02.
 *
 * 16-bit ports were introduced in MSP430X and are available on
 * several chips in the 2xx and 4xx family.  In 2xx/4xx MCUs, PORTA
 * overlays P7/P8; in 5xx MCUs it overlays P1/P2.
 *
 * In pre-5xx families, registers supporting interrupts have a
 * different layout than registers that do not support interrupts.
 * However, the layouts (exclusive of SEL2 and REN) are compatible
 * within those types.
 *
 * Thus there are several distinct layouts that need to be supported:
 *
 * + [PORT_IE_8] Pre-5xx interrupt-capable, 8-bit interface
 * + [PORT_8] Pre-5xx non-interrupt, 8-bit interface
 * + [PORT_16] Pre-5xx non-interrupt, 16-bit interface
 * + [PORT_5XX] 5xx registers, 8-bit interface
 * + [PORT_5XX_16] 5xx registers, 16-bit interface
 *
 * 5xx chips are identified by MSP430XV2_CPU.  For these, a uniform
 * HPL based on the 16-bit alphabetic register names is presented.
 */

/** Layout for pre-5xx--family ports supporting interrupts.
 *
 * Access to SEL2 capability for these ports is not available in the
 * hardware-presentation layer. */
typedef struct xBSP430periphPORT_IE_8 {
	unsigned char in;			/* 0x00 */
	unsigned char out;			/* 0x01 */
	unsigned char dir;			/* 0x02 */
	unsigned char ifg;			/* 0x03 */
	unsigned char ies;			/* 0x04 */
	unsigned char ie;			/* 0x05 */
	unsigned char sel;			/* 0x06 */
	unsigned char ren;			/* 0x07 */
} xBSP430periphPORT_IE_8;

/** Layout for pre-5xx--family 8-bit ports not supporting interrupts.
 *
 * Access to SEL2 and REN capability for these ports is not available
 * in the hardware-presentation layer. */
typedef struct xBSP430periphPORT_8 {
	unsigned char in;			/* 0x00 */
	unsigned char out;			/* 0x01 */
	unsigned char dir;			/* 0x02 */
	unsigned char sel;			/* 0x03 */
} xBSP430periphPORT_8;

/** Helper for accessing 8-bit registers within 16-bit registers */
typedef union xBSP430periphPORT_16_u {
	unsigned int w;				/**< Word access (e.g., PAIN) */
	unsigned char b[2];			/**< Byte access, indexed */
	struct {
		unsigned char l;		/**< Low byte access for odd members of pair (e.g., P1IN) */
		unsigned char h;		/**< High byte access for even members of pair (e.g., P2IN) */
	};
} xBSP430periphPORT_16_u;

/** Layout for 2xx/4xx family 16-bit ports not supporting interrupts.
 *
 * Access to SEL2 and REN capability for these ports is not available
 * in the hardware-presentation layer. */
typedef struct xBSP430periphPORT_16 {
	xBSP430periphPORT_16_u in;	/* 0x00 */
	xBSP430periphPORT_16_u out;	/* 0x02 */
	xBSP430periphPORT_16_u dir;	/* 0x04 */
	xBSP430periphPORT_16_u sel;	/* 0x08 */
} xBSP430periphPORT_16;

/** Layout for 5xx family ports, 16-bit access
 */
typedef struct xBSP430periphPORT_5XX_16 {
	xBSP430periphPORT_16_u in;	/* 0x00 */
	xBSP430periphPORT_16_u out;	/* 0x02 */
	xBSP430periphPORT_16_u dir;	/* 0x04 */
	xBSP430periphPORT_16_u ren;	/* 0x06 */
	unsigned int _reserved_x08;
	xBSP430periphPORT_16_u sel0; /* 0x0A */
	xBSP430periphPORT_16_u sel1; /* 0x0C */
	unsigned int _reserved_x0E;
	xBSP430periphPORT_16_u selc; /* 0x10 */
	unsigned int _reserved_x12;
	unsigned int _reserved_x14;
	unsigned int _reserved_x16;
	xBSP430periphPORT_16_u ies;	 /* 0x18 */
	xBSP430periphPORT_16_u ie;	 /* 0x1A */
	xBSP430periphPORT_16_u ifg;	 /* 0x1C */
} xBSP430periphPORT_5XX_16;

/** Layout for 5xx family ports, 8-bit access
 *
 * This structure includes the necessary padding to maintain alignment
 * when referencing the second 8-bit register in a 16-bit bank.
 */
typedef struct xBSP430periphPORT_5XX_8 {
	unsigned char in;	/* 0x00 */
	unsigned char _reserved_x01;
	unsigned char out;	/* 0x02 */
	unsigned char _reserved_x03;
	unsigned char dir;	/* 0x04 */
	unsigned char _reserved_x05;
	unsigned char ren;	/* 0x06 */
	unsigned char _reserved_x07;
	unsigned char _reserved_x08;
	unsigned char _reserved_x09;
	unsigned char sel0; /* 0x0A */
	unsigned char _reserved_x0B;
	unsigned char sel1; /* 0x0C */
	unsigned char _reserved_x0D;
	unsigned char _reserved_x0E;
	unsigned char _reserved_x0F;
	unsigned char selc; /* 0x10 */
	unsigned char _reserved_x11;
	unsigned char _reserved_x12;
	unsigned char _reserved_x13;
	unsigned char _reserved_x14;
	unsigned char _reserved_x15;
	unsigned char _reserved_x16;
	unsigned char _reserved_x17;
	unsigned char ies;	 /* 0x18 */
	unsigned char _reserved_x19;
	unsigned char ie;	 /* 0x1A */
	unsigned char _reserved_x1B;
	unsigned char ifg;	 /* 0x1C */
} xBSP430periphPORT_5XX_8;

/** @cond DOXYGEN_INTERNAL */
#if defined(__MSP430_HAS_MSP430XV2_CPU__)
#define _BSP430_PERIPH_PORTIE xBSP430periphPORT_5XX_8
#define _BSP430_PERIPH_PORT xBSP430periphPORT_5XX_8
#define _BSP430_PERIPH_PORTW xBSP430periphPORT_5XX_16
#else /* MSP430XV2 */
#define _BSP430_PERIPH_PORTIE xBSP430periphPORT_IE_8
#define _BSP430_PERIPH_PORT xBSP430periphPORT_8
#define _BSP430_PERIPH_PORTW xBSP430periphPORT_16
#endif /* MSP430XV2 */
/** @endcond */ /* DOXYGEN_INTERNAL */

/** Structure used to access ports with interrupt capability.
 *
 * The underlying structure selected depends on the MCU family. */
typedef _BSP430_PERIPH_PORTIE xBSP430periphPORTIE;

/** Structure used to access ports without interrupt capability.
 *
 * The underlying structure selected depends on the MCU family. */
typedef _BSP430_PERIPH_PORT xBSP430periphPORT;

/** Structure used to access 16-bit ports.
 *
