/* Copyright (c) 2012, Peter A. Bigot
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright notice,
 *   this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright notice,
 *   this list of conditions and the following disclaimer in the documentation
 *   and/or other materials provided with the distribution.
 *
 * * Neither the name of the software nor the names of its contributors may be
 *   used to endorse or promote products derived from this software without
 *   specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)

 * SEL2, which is contiguous at a distinct base address, and have
 * interrupt capability.  P3-P6 are uniform 8-bit and P7-P8 are
 * uniform 16-bit contiguous, exclusive of REN and SEL2.  If any port
 * has SEL2, all ports have SEL2.  PA=(P7,P8) in the headers, but is
 * not named as such in the user's guide.
 *
 * 3xx: P1/P2 are uniform contiguous with interrupt capability.  P3-P4
 * are uniform contiguous without interrupt capability.  There is no
 * REN capability.
 *
 * 4xx: P1/P2 are uniform contiguous including REN capability, and
 * have interrupt capability.  P3-P6 are uniform 8-bit and P7-P10 are
 * uniform 16-bit contiguous; these are exclusive of REN, which is
 * contiguous at a distinct base address.  Some MCUs have SEL2 on P1,
 * but no other ports have SEL2.  PA=(P7,P8), PB=(P9,P10).
 *
 * 5xx: All ports uniform 16-bit contiguous.  PA=(P1,P2), PB=(P3,P4),
 * and so forth.  All registers have space reserved for interrupt
 * support.  Only FR5XX has PxSELC.
 *
 * In the above, "8-bit" means that the register fields are
 * immediately adjacent with byte addresses.  "16-bit" means that
 * register pairs are interleaved within function; e.g. P1IN would be
 * at 0x00 while P2IN is at 0x01 and P1OUT at 0x02.
 *
 * 16-bit ports were introduced in MSP430X and are available on
 * several chips in the 2xx and 4xx family.  In 2xx/4xx MCUs, PORTA
 * overlays P7/P8; in 5xx MCUs it overlays P1/P2.
 *
 * In pre-5xx families, registers supporting interrupts have a
 * different layout than registers that do not support interrupts.
 * However, the layouts (exclusive of SEL2 and REN) are compatible
 * within those types.
 *
 * Thus there are several distinct layouts that need to be supported:
 *
 * + [PORT_IE_8] Pre-5xx interrupt-capable, 8-bit interface
 * + [PORT_8] Pre-5xx non-interrupt, 8-bit interface
 * + [PORT_16] Pre-5xx non-interrupt, 16-bit interface
 * + [PORT_5XX] 5xx registers, 8-bit interface
 * + [PORT_5XX_16] 5xx registers, 16-bit interface
 *
 * 5xx chips are identified by MSP430XV2_CPU.  For these, a uniform
 * HPL based on the 16-bit alphabetic register names is presented.
 */

/** @def BSP430_PORT_SUPPORTS_REN
 *
 * A macro that is defined to a true value if the port peripheral
 * supports a resistor-enable register, and to a false value if it
 * does not.
 *
 * This can be used in application and library code to use or avoid
 * reference to the @a ren field of HPL structures, either directly or
 * though the #BSP430_PORT_HAL_HPL_REN() macro.
 *
 * Support for the PxREN register is determined by the @c
 * __MSP430_HAS_PORT1_R__ functional presence indicator for
 * <msp430.h>; in all MCUs, if P1 has the feature, so do any other
 * ports.
 */
#if defined(__MSP430_HAS_PORT1_R__)
#define BSP430_PORT_SUPPORTS_REN 1
#else /* P1REN */
#define BSP430_PORT_SUPPORTS_REN 0
#endif /* P1REN */

/** Layout for pre-5xx--family ports supporting interrupts.
 *
 * Access to SEL2 capability for these ports is not available in the
 * hardware-presentation layer. */
typedef struct sBSP430hplPORT_IE_8 {
  unsigned char in;			/* 0x00 */
  unsigned char out;			/* 0x01 */
  unsigned char dir;			/* 0x02 */
  unsigned char ifg;			/* 0x03 */
  unsigned char ies;			/* 0x04 */
  unsigned char ie;			/* 0x05 */
  unsigned char sel;			/* 0x06 */
  unsigned char ren;			/* 0x07 */
} sBSP430hplPORT_IE_8;

/** Layout for pre-5xx--family 8-bit ports not supporting interrupts.
 *
 * Access to SEL2 and REN capability for these ports is not available
 * in the hardware-presentation layer. */
typedef struct sBSP430hplPORT_8 {
  unsigned char in;			/* 0x00 */
  unsigned char out;			/* 0x01 */
  unsigned char dir;			/* 0x02 */
  unsigned char sel;			/* 0x03 */
} sBSP430hplPORT_8;

/** Helper for accessing 8-bit registers within 16-bit registers */
typedef union uBSP430hplPORT_16 {
  unsigned int w;				/**< Word access (e.g., PAIN) */
  unsigned char b[2];			/**< Byte access, indexed */
  struct {
    unsigned char l;		/**< Low byte access for odd members of pair (e.g., P1IN) */
    unsigned char h;		/**< High byte access for even members of pair (e.g., P2IN) */
  };
} uBSP430hplPORT_16;

/** Layout for 2xx/4xx family 16-bit ports not supporting interrupts.
 *
 * Access to SEL2 and REN capability for these ports is not available
 * in the hardware-presentation layer. */
typedef struct sBSP430hplPORT_16 {
  uBSP430hplPORT_16 in;	/* 0x00 */
  uBSP430hplPORT_16 out;	/* 0x02 */
  uBSP430hplPORT_16 dir;	/* 0x04 */
  uBSP430hplPORT_16 sel;	/* 0x08 */
} sBSP430hplPORT_16;

/** Layout for 5xx family ports, 16-bit access
 */
typedef struct sBSP430hplPORT_5XX_16 {
  uBSP430hplPORT_16 in;	/**< PxIN */ /* 0x00 */
  uBSP430hplPORT_16 out;	/**< PxOUT */ /* 0x02 */
  uBSP430hplPORT_16 dir;	/**< PxDIR (set for output) */ /* 0x04 */
  uBSP430hplPORT_16 ren;	/**< PxREN (set to enable) */ /* 0x06 */
  uBSP430hplPORT_16 ds;	/**< PxDS (drive select, some devices) */ /* 0x08 */
  union {
    uBSP430hplPORT_16 sel; /**< PxSEL (non-FR5xx devices) */ /* 0x0A */
    uBSP430hplPORT_16 sel0; /**< PxSEL0 (FR5xx devices) */ /* 0x0A */
  };
  uBSP430hplPORT_16 sel1; /**< PxSEL1 (secondary/tertiary function, FR5xx devices only) */ /* 0x0C */
  unsigned int _reserved_x0E;
  uBSP430hplPORT_16 selc; /**< PxSELC (support atomic transition to tertiary function, FR5xx devices only) */ /* 0x10 */
  unsigned int _reserved_x12;
  unsigned int _reserved_x14;
  unsigned int _reserved_x16;
